

version = {
    "curr": "0.2.11",
    "history": {
        "0.0.1": "实现基本的拼音字帖和汉字字帖",
        "0.0.2": "1. 支持方格\n"
                 "2. 支持回宫格",
        "0.0.3": "1. 支持预览\n"
                 "2. 优化汉字字帖生成逻辑",
        "0.0.4": "优化界面",
        "0.0.5": "支持实时预览",
        "0.1.6": "升级reportlab，解决某些ttf字体时会出错，导致程序崩溃的问题。",
        "0.2.7": "新增数字字帖。",
        "0.2.8": "汉字字帖支持添加拼音行。",
        "0.2.9": "支持看拼音写汉字和看汉字写拼音",
        "0.2.10": "支持Windows",
        "0.2.11": "1、支持隔行方式\n"
                  "2. 支持配置文件中配置方格宽高",
        "0.2.12": "1、支持竖行\n"
    }
}
